#Область ПОЛЬЗ0

Функция ИмяБлокаПОЛЬЗ0() Экспорт
	
	Возврат "ПОЛЬЗ0";
	
КонецФункции

Функция ТекстЗаголовкаПОЛЬЗ0(Знач дПериод = Неопределено) Экспорт
	Перем сЗаголовок, сДата;
	
	Если ТипЗнч(дПериод) = Тип("Дата") Тогда
		сДата = Формат(дПериод, "ДФ=dd.MM.yy")
	Иначе
		сДата = Формат(ТекущаяДата(),"ДФ=dd.MM.yy");
	КонецЕсли;
	
	сЗаголовок = НСтр("ru = 'Курсы валют на %1'");
	сЗаголовок = СтрШаблон(сЗаголовок, сДата);
	
	Возврат сЗаголовок;
КонецФункции

Функция Обновление_ПОЛЬЗ0(стПараметры) Экспорт
	
КонецФункции

#КонецОбласти

#Область ПОЛЬЗ1

Функция ИмяБлокаПОЛЬЗ1() Экспорт
	
	Возврат "ПОЛЬЗ1";
	
КонецФункции

Функция ТекстЗаголовкаПОЛЬЗ1() Экспорт
	
	Возврат НСтр("ru = 'Виджет пользователя 02'");
	
КонецФункции

Функция Обновление_ПОЛЬЗ1(стПараметры) Экспорт
	
КонецФункции

#КонецОбласти

#Область ПОЛЬЗ2

Функция ИмяБлокаПОЛЬЗ2() Экспорт
	
	Возврат "ПОЛЬЗ2";
	
КонецФункции

Функция ТекстЗаголовкаПОЛЬЗ2() Экспорт
	
	Возврат НСтр("ru = 'Виджет пользователя 03'");
	
КонецФункции

Функция Обновление_ПОЛЬЗ2(стПараметры) Экспорт
	
КонецФункции

#КонецОбласти
