#Область ПОЛЬЗ0

Функция КурсыВалютКакМассив() Экспорт
	Перем мКурсыВалют, Запрос, РезультатЗапроса, ВыборкаИзЗапроса, элементВыборки, стКурс;
	
	мКурсыВалют = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 3
	               |	КурсыВалютСрезПоследних.Валюта.Наименование КАК сВалюта,
	               |	КурсыВалютСрезПоследних.Курс КАК чКурс,
	               |	КурсыВалютСрезПоследних.Период КАК дПериод
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Дата1, ) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("Дата1", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаИзЗапроса.Следующий() Цикл
			стКурс = Новый Структура();
			стКурс.Вставить("сВалюта",ВыборкаИзЗапроса.сВалюта);
			стКурс.Вставить("чКурс", ВыборкаИзЗапроса.чКурс);
			стКурс.Вставить("дПериод", ВыборкаИзЗапроса.дПериод);
			мКурсыВалют.Добавить(стКурс);				
		КонецЦикла;		
	КонецЕсли;	
	
	Возврат мКурсыВалют;
КонецФункции

#КонецОбласти