#Область ПОЛЬЗ0

&НаСервере
Функция КурсыВалютКакМассив()
	Перем мКурсыВалют, Запрос, РезультатЗапроса, ВыборкаИзЗапроса, элементВыборки, стКурс;
	
	мКурсыВалют = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 3
	               |	КурсыВалютСрезПоследних.Валюта.Наименование КАК Валюта,
	               |	КурсыВалютСрезПоследних.Курс КАК Курс
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Дата1, ) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("Дата1", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();
		Для каждого элементВыборки Из ВыборкаИзЗапроса Цикл
			стКурс = Новый Структура();
			стКурс.Вставить("Валюта",элементВыборки.Валюта);
			стКурс.Вставить("Курс", элементВыборки.Курс);
			мКурсыВалют.Добавить(стКурс);			
		КонецЦикла;		
	КонецЕсли;	
	
	Возврат мКурсыВалют;
КонецФункции


#КонецОбласти