&НаКлиенте
Перем м_чИнтервалОбновления;

&НаКлиенте
Процедура ВидБух_ПриОткрытииПосле(Отказ)

	Если ТипЗнч(м_чИнтервалОбновления) <> Тип("Число") ИЛИ м_чИнтервалОбновления < 10 Тогда
		м_чИнтервалОбновления = 10;
	КонецЕсли;
	ПодключитьОбработчикОжидания("Подключаемый_Обновление_ПОЛЬЗ", м_чИнтервалОбновления, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Обновление_ПОЛЬЗ()
	
	// Полное обновление всех блоков
	БыстроеОбновление = Ложь;
	ПрочитатьДанныеСтатическихБлоков = Истина;
	ОбновитьДанныеБлоков(БыстроеОбновление, ПрочитатьДанныеСтатическихБлоков);
	
КонецПроцедуры

#Область Управление_формой

&НаКлиентеНаСервереБезКонтекста
&После("УправлениеФормой")
Процедура ВидБух_УправлениеФормой(Форма)
	
	УправлениеБлоком_ПОЛЬЗ0(Форма);
	
	УправлениеБлоком_ПОЛЬЗ1(Форма);
	
	УправлениеБлоком_ПОЛЬЗ2(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлоком_ПОЛЬЗ0(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.ПОЛЬЗ0.Родитель = Элементы.БлокиПанели Тогда
		// Блок отключен
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлоком_ПОЛЬЗ1(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.ПОЛЬЗ1.Родитель = Элементы.БлокиПанели Тогда
		// Блок отключен
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеБлоком_ПОЛЬЗ2(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.ПОЛЬЗ2.Родитель = Элементы.БлокиПанели Тогда
		// Блок отключен
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

м_чИнтервалОбновления = 60;